


hello_text = """Привет! Добро пожаловать в квест-комнату музея А. Зеленко!
Готов ли ты начать приключение по моей комнате?"""

register_text = """Давай знакомиться! Как тебя зовут? Укажи только имя."""

register_name_text = "Как тебя зовут?\nНапиши только лишь своё имя, без цифр и прочих символов."

question_morze_text = """В моем доме можно послушать звуки предметов из прошлого. 
Например, у меня хранится “дедушка” телефона -  телеграф. 
Раньше самые важные сообщения передавали по нему. 
Только это было не так-то просто! Чтобы передать сообщение по телеграфу, нужно знать специальную азбуку – азбуку Морзе. 
Попробуй написать своё имя с помощью азбуки Морзе.\nЗашифруйте имя, которое было введено в начале квеста. Введите точки и тире без пробелов."""


# Словарь всех сообщений.
Messages = {
    "start": hello_text,
    "reg": register_text,
    "reg_name": register_name_text,
    "question_morze": question_morze_text,
}